cask_args appdir: '/Applications'

tap 'homebrew/bundle'

brew 'ack'
brew 'coreutils'
brew 'grc'
brew 'git'
brew 'hub'
brew 'imagemagick'
brew 'mas'
brew 'node'
brew 'ruby-build'
brew 'rbenv'
brew 'trash'
brew 'wget'
brew 'youtube-dl'
brew 'yarn'

# Applications
cask '1password'
cask 'adobe-creative-cloud'
cask 'alfred'
cask 'basecamp'
# cask 'evernote'
cask 'dropbox'
cask 'firefox'
cask 'flux'
cask 'gitup'
cask 'google-chrome'
cask 'google-drive'
cask 'hyper'
cask 'imagealpha'
cask 'imageoptim'
cask 'iterm2'
cask 'keepingyouawake'
cask 'licecap'
cask 'mattr-slate'
cask 'rescuetime'
cask 'selfcontrol'
cask 'sequel-pro'
cask 'skitch'
cask 'sketch'
cask 'skyfonts'
cask 'slack'
cask 'spotify'
cask 'sublime-text'
# cask 'things'
cask 'transmission'
cask 'vlc'

# Quicklook Plugins
cask 'betterzipql'
cask 'qlcolorcode'
cask 'qlmarkdown'
cask 'qlprettypatch'
cask 'qlstephen'
cask 'quicklook-csv'
cask 'quicklook-json'
cask 'suspicious-package'
cask 'webpquicklook'

# Mac App Store
# mas 'iA Writer Classic', id: 439623248
mas 'iA Writer', id: 775737590
mas 'Sip', id: 507257563
mas 'The Unarchiver', id: 425424353
mas 'Evernote', id: 406056744
mas 'MapTiler', id: 593541065
mas 'GIPHY CAPTURE', id: 668208984
# mas 'Sketch', id: 852320343
mas 'Keynote', id: 409183694
mas 'Numbers', id: 409203825
mas 'Pages', id: 409201541
# mas 'Dash', id: 458034879
# mas 'Caffeine', id: 411246225
mas 'Things 3', id: 904280696
mas 'Tweetbot', id: 557168941
mas 'Xcode', id: 497799835
