cask_args appdir: '/Applications'

tap 'homebrew/bundle'
tap 'homebrew/cask-versions'

brew 'ack'
brew 'coreutils'
brew 'grc'
brew 'git'
brew 'hub'
brew 'imagemagick'
brew 'mas'
brew 'node'
brew 'tippecanoe'
brew 'trash'
brew 'wget'
brew 'youtube-dl'
brew 'yarn'

# Applications
cask '1password6'
cask 'adobe-creative-cloud'
cask 'alfred3'
cask 'bettertouchtool'
cask 'browserstacklocal'
cask 'docker'
cask 'dropbox'
cask 'firefox'
cask 'gitup'
cask 'google-chrome'
cask 'imagealpha'
cask 'imageoptim'
cask 'iterm2'
cask 'kap-beta'
cask 'keepingyouawake'
cask 'mattr-slate'
cask 'rescuetime'
cask 'sequel-pro'
cask 'skitch'
cask 'sketch'
cask 'skyfonts'
cask 'slack'
cask 'spotify'
cask 'visual-studio-code'
cask 'vlc'
cask 'zoomus'

# Quicklook Plugins
cask 'betterzip'
cask 'qlcolorcode'
cask 'qlmarkdown'
cask 'qlprettypatch'
cask 'qlstephen'
cask 'quicklook-csv'
cask 'quicklook-json'
cask 'suspicious-package'
cask 'webpquicklook'

# Mac App Store
mas 'iA Writer', id: 775737590
mas 'Sip', id: 507257563
mas 'The Unarchiver', id: 425424353
mas 'Evernote', id: 406056744
mas 'MapTiler', id: 593541065
mas 'GIPHY CAPTURE', id: 668208984
mas 'Keynote', id: 409183694
mas 'Numbers', id: 409203825
mas 'Pages', id: 409201541
mas 'Things 3', id: 904280696
mas 'Xcode', id: 497799835
mas 'Dato', id: 1470584107
